app/views/players/_player.html.erb

SELECT "contracts".* FROM "contracts" WHERE "contracts"."player_id" = 1 LIMIT 1
---

<% if player.contract.present? %>