app/controllers/teams_controller.rb

  def show
    @team = Team.find params[:id]
    @players = @team.players.includes(:contract)
---
SELECT "teams".* FROM "teams" WHERE "teams"."id" = ? LIMIT 1  [["id", "1"]]
SELECT "contracts".* FROM "contracts" WHERE "contracts"."player_id" IN (1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11)
SELECT "players".* FROM "players" WHERE "players"."team_id" IN (1)